powershell/request-param.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:uploadFileRequest>
            <gs:name>Spain</gs:name>
            <gs:file>s12fdsf</gs:file>
        </gs:uploadFileRequest>
    </soapenv:Body>
</soapenv:Envelope>